In [1]:
import pandas as pd

In [2]:
Student = pd.read_excel("Student.xlsx")

In [3]:
Student

   Unnamed: 0      name  age state semester
0           0  Suryansh   20    MP      3rd
1           1    Ganesh   24    MP      6th
2           2    Aakash   26    MP  Passout
3           3    Vakhya   24    MP      7th

In [7]:
Student= Student.drop(columns=["Unnamed: 0"])

In [8]:
Student # Select * from Student

       name  age state semester
0  Suryansh   20    MP      3rd
1    Ganesh   24    MP      6th
2    Aakash   26    MP  Passout
3    Vakhya   24    MP      7th

In [10]:
 # Select * from student order by age desc;
older=Student.sort_values(by="age",ascending=False)

In [11]:
older # select * from older

       name  age state semester
2    Aakash   26    MP  Passout
1    Ganesh   24    MP      6th
3    Vakhya   24    MP      7th
0  Suryansh   20    MP      3rd

In [12]:
%pip install openpyxl
older.to_excel("older.xlsx",index=False)

Requirement already satisfied: openpyxl in /home/codespace/.python/current/lib/python3.12/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /home/codespace/.python/current/lib/python3.12/site-packages (from openpyxl) (2.0.0)

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [13]:
older1=pd.read_excel("older.xlsx")

In [14]:
older1

       name  age state semester
0    Aakash   26    MP  Passout
1    Ganesh   24    MP      6th
2    Vakhya   24    MP      7th
3  Suryansh   20    MP      3rd

In [16]:
older1.loc[older1["age"]==26] # Find / Searching

     name  age state semester
0  Aakash   26    MP  Passout

In [17]:
older1.loc[older1["age"]>20] # Find / Searching

     name  age state semester
0  Aakash   26    MP  Passout
1  Ganesh   24    MP      6th
2  Vakhya   24    MP      7th

In [19]:
older1.iloc[[1]] # inverse mapping

     name  age state semester
1  Ganesh   24    MP      6th

In [20]:
older1.at[1,"age"]

np.int64(24)